'use strict';

let path = require('path'); // техническая переменная, необходимая для правильной работы

module.exports = {  // объект настроек
  mode: 'development', // режим работы, их два (development и production(по умолчанию, работает медленнее, в него встроены оптимизаторы кода))
  entry: './src/js/script.js', // энтри поинт, тот файл, с которого будем начинать, обычно в нем прописаны все зависимости, require или import
  output: { // файл выхода, задаем только в виде объекта, в который будет собираться код
    filename: 'bundle.js', // название
    path: __dirname + '/src/js' // путь к итоговому файлу. Переменная __dirname позволяет получить доступ к корню нашей папки проекта
  },
  watch: true, // если true, то webpack будет отслеживать изменение нашего файла и будет собирать проект при каждом сэйве наших файлов

  devtool: "source-map", // source-map хранит информацию об исходниках кода для финальной сборки

  module: {} // модули для webpack и их настройка

	// также может быть еще свойство plugins, оно нужно для подключения различных плагинов, но используется не часто, т.к. все нужные плагины уже есть в webpack
};
